driver-tests/pojose/txn/jms/caTstTxnJMS/src/jbiasa/caTstTxnJMS.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caTstTxnJMS"
             xmlns:tns="caTstTxnJMS" xmlns:ns="http://driver.txn.tst.sun.com/JMSTxnTestDriver/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://driver.txn.tst.sun.com/JMSTxnTestDriver/" location="../jbiServiceUnits/jseJMSTxn/com/sun/tst/txn/driver/JMSTxnTestDriver.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:JMSTxnTestDriverInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="JMSTxnTestDriverOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caTstTxnJMS"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caTstTxnJMS"/>
            </output>
        </operation>
    </binding>
    <service name="caTstTxnJMSService1">
        <port name="pojoTxnJmsTstDriverPort" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/caTstTxnJMSService1/pojoTxnJmsTstDriverPort"/>
        </port>
    </service>
</definitions>

