driver-tests/pojose/txn/jms/caTstTxnJMS/test/testInOutNveOrError/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cat="caTstTxnJMS">
  <soapenv:Body>
    <cat:JMSTxnTestDriverOperation>
      <part1>TestInOutTxnNegativeOnReplyError</part1>
    </cat:JMSTxnTestDriverOperation>
  </soapenv:Body>
</soapenv:Envelope>